translations = {
    "en": """🤖 Welcome to our Telegram bot!

        To get started, we recommend diving right into the fun by executing the "/topquiz" command. This will show you the best available quizzes to test your knowledge and have some entertainment! 🎉

        If you prefer to explore other features of our bot, you can try the "/reg" command. This command allows you to register as either an Agent or a Client. Agents will have access to additional commands like "/tickets" to check existing tickets, manage ticket status, assignees, and more. If you're a Client, you can create new tickets using the "/ticket" command.

        Here are some commands you can use after registration:

        For Agents:
        - "/tickets": View and manage existing tickets.
        - "/assign": Assign tickets to specific agents.
        - "/status": Change the status of a ticket.
        - "/resolve": Resolve a ticket once it's done.

        For Clients:
        - "/ticket": Create a new ticket.
        - "/status": Check the status of your ticket.
        - "/assignee": Assign a ticket to a specific agent.

        Please note that some commands may require appropriate user roles or permissions.

        So, go ahead and explore the bot! If you have any questions or need any assistance, feel free to reach out to our support team. Enjoy your experience! 🚀""",
    "es": """🤖 ¡Bienvenido a nuestro bot de Telegram!

        Para empezar, te recomendamos sumergirte de inmediato en la diversión ejecutando el comando "/topquiz". ¡Esto te mostrará los mejores cuestionarios disponibles para poner a prueba tus conocimientos y divertirte! 🎉

        Si prefieres explorar otras funciones de nuestro bot, puedes probar el comando "/reg". Este comando te permite registrarte como Agente o Cliente. Los Agentes tendrán acceso a comandos adicionales como "/tickets" para consultar tickets existentes, gestionar el estado de los tickets, los asignados y más. Si eres un Cliente, puedes crear nuevos tickets usando el comando "/ticket".

        Aquí tienes algunos comandos que puedes usar después de registrarte:

        Para los Agentes:
        - "/tickets": Ver y gestionar tickets existentes.
        - "/assign": Asignar tickets a agentes específicos.
        - "/status": Cambiar el estado de un ticket.
        - "/resolve": Resolver un ticket una vez que esté completado.

        Para los Clientes:
        - "/ticket": Crear un nuevo ticket.
        - "/status": Ver el estado de tu ticket.
        - "/assignee": Asignar un ticket a un agente específico.

        Ten en cuenta que algunos comandos pueden requerir roles o permisos de usuario adecuados.

        ¡Así que adelante y explora nuestro bot! Si tienes alguna pregunta o necesitas ayuda, no dudes en ponerte en contacto con nuestro equipo de soporte. ¡Disfruta de tu experiencia! 🚀""",
    "ru" : """🤖 Добро пожаловать в наш бот Telegram!

        Для начала мы рекомендуем погрузиться в самое интересное, выполнив команду «/topquiz». Это покажет вам лучшие доступные викторины, чтобы проверить свои знания и немного развлечься! 🎉

        Если вы предпочитаете изучить другие функции нашего бота, вы можете попробовать команду «/reg». Эта команда позволяет вам зарегистрироваться в качестве Агента или Клиента. Агенты будут иметь доступ к дополнительным командам, таким как «/tickets», для проверки существующих заявок, управления статусом заявки, исполнителями и т. д. Если вы клиент, вы можете создавать новые заявки с помощью команды «/ticket».

        Вот некоторые команды, которые вы можете использовать после регистрации:

        Для агентов:
        - "/tickets": просмотр и управление существующими заявками.
        - "/assign": Назначение заявок конкретным агентам.
        - "/status": изменить статус заявки.
        - "/resolve": разрешить заявку после ее завершения.

        Для клиентов:
        - "/ticket": создать новый билет.
        - "/status": проверьте статус вашего билета.
        - "/assignee": назначить билет конкретному агенту.

        Обратите внимание, что для некоторых команд могут потребоваться соответствующие роли пользователей или разрешения.

        Итак, вперед, исследуйте бота! Если у вас есть какие-либо вопросы или вам нужна помощь, не стесняйтесь обращаться к нашей команде поддержки. Наслаждайтесь своим опытом! 🚀""",
    
    "uk" : """🤖 Ласкаво просимо до нашого Telegram-бота!

        Щоб розпочати, ми рекомендуємо відразу зануритися в розваги, виконавши команду "/topquiz". Це покаже вам найкращі доступні тести, щоб перевірити свої знання та трохи розважитися! 🎉

        Якщо ви бажаєте дослідити інші функції нашого бота, ви можете спробувати команду "/reg". Ця команда дозволяє вам зареєструватися як агент або клієнт. Агенти матимуть доступ до додаткових команд, таких як "/tickets", щоб перевіряти наявні заявки, керувати статусом заявок, правонаступниками тощо. Якщо ви Клієнт, ви можете створити нові квитки за допомогою команди "/ticket".

        Ось кілька команд, якими можна скористатися після реєстрації:

        Для агентів:
        - "/tickets": перегляд наявних квитків і керування ними.
        - "/assign": призначити квитки певним агентам.
        - "/status": змінити статус квитка.
        - "/resolve": Вирішити заявку, коли це буде зроблено.

        Для клієнтів:
        - "/ticket": створити новий квиток.
        - "/status": перевірити статус вашого квитка.
        - "/assignee": призначити квиток певному агенту.

        Зауважте, що деякі команди можуть потребувати відповідних ролей користувача або дозволів.

        Отже, продовжуйте досліджувати бота! Якщо у вас виникли запитання або вам потрібна допомога, зверніться до нашої служби підтримки. Насолоджуйтесь враженнями! 🚀""",
    "Россияen" : "Russia",
    "Россияuk" : "Росія",
    "Россияru" : "Россия",
    "СШАen" : "USA",
    "СШАru" : "США",
    "СШАuk" : "США",
    "Украинаen" : "Ukraine",
    "Украинаru" : "Украина",
    "Украинаuk" : "Україна",
    
    "mainen" : "Hello, welcome to the self-learning center, let me clarify a couple of things.\nOptional, use /cancel to cancel, it's just a test for a motherfucker \n\nWho is the aggressor?\n\nUkraine or Russia?",
    "mainru" : "Привет, добро пожаловать в центр самообучения, позволь уточнить пару моментов.\nНеобязательно, пошли /cancel для отмены, просто это тест на долбоеба \n\nКто агрессор?\n\nУкраина или Россия?",
    "mainuk" : "Привіт, ласкаво просимо до центру самонавчання, дозволь уточнити пару моментів.\nНеобов'язково, пішли /cancel для скасування, просто це тест на довбоєба \n\nХто агресор?\n\nУкраїна чи Росія?",
    
    "Украина или Россия?en" : "Ukraine or Russia?",
    "Украина или Россия?ru" : "Украина или Россия?",
    "Украина или Россия?uk" : "Україна чи Росія?",

    "Вы были заблокированы из-за неправильных ответов.en" : "You have been blocked due to incorrect answers.",
    "Вы были заблокированы из-за неправильных ответов.ru" : "Вас заблокували через неправильні відповіді.",
    "Вы были заблокированы из-за неправильных ответов.uk" : "Вы были заблокированы из-за неправильных ответов.",
    "relaxen" : "Relax dude, postpone it till tomorrow, like you've done it your whole life. You won't make it!",
    "relax2en" : "Joking! You're doing great! Keep up the good work! 😄",
    "relaxru" : "Расслабься, чувак, отложи на завтра, как будто всю жизнь этим занимался. Не сможешь!",
    "relax2ru" : "Шучу! У тебя отлично получается! Продолжай в том же духе! 😄",
    "relaxuk" : "Розслабся, чувак, відклади це на завтра, ніби ти робив це все життя. Ти не встигнеш!",
    "relax2uk" : "Жартую! у вас все чудово! Продовжуй гарно працювати! 😄",
    "nicknameen" : "Please set nickname",
    "nicknameru" : "Задай се никнейм",
    "nicknameuk" : "Будь ласка, встановіть псевдонім",
    
        # Add more translations if needed
    }
