# # # TODO: HELP # # #
################

################
translations = {
    "help_en": """"🤖 Welcome to the oneSitePls Bot Help! Here are the available commands:

                /help - Display this help message
                /start - Welcome message
                /reg - Set your nickname and register as support Agent
                /regClient - Set your nickname and register as Client
                /go - Create Support ticket
                /msg {nickname} {message} - Forward a message to a user
                
                But dirst of all check out /topquiz or /start🚀""",
    "help_uk": """🤖 Вітаємо в довідці oneSitePls Bot! Ось доступні команди:

                 /help - відобразити це повідомлення довідки
                 /start - Вітальне повідомлення
                 /reg - Встановіть свій псевдонім і зареєструйтеся як агент підтримки
                 /regClient - Встановіть свій псевдонім і зареєструйтеся як клієнт
                 /go - створити заявку підтримки
                 /msg {нік} {повідомлення} - переслати повідомлення користувачеві
                
                 Але перш за все перевірте /topquiz або /start🚀""",
    "help_ru": """🤖 Добро пожаловать в справку oneSitePls Bot! Вот доступные команды:

                 /help - Показать это справочное сообщение
                 /start - Подробности возможностей
                 /reg - Установите свой никнейм и зарегистрируйтесь как Агент
                 /regClient - Установите свой никнейм и зарегистрируйтесь как Клиент
                 /go - создать заявку на поддержку
                 /msg {псевдоним} {сообщение} - переслать сообщение пользователю

                 Но для начала зацени /topquiz или /start🚀""",
    "en": """To start, we recommend diving into the most interesting part by executing the command "/topquiz".
        This will show you the best available quizzes to test your knowledge and have some fun! 🎉

        If you prefer to explore other features of our bot, you can try the following commands:
        - /start
        - /help
        - /reg or /regClient.
        This command allows you to register as an Agent or a Client. Agents and Clients will have access to additional commands.

        Here are some commands you can use after registration:
        - /go or /ticket: create a new support ticket.
        - /estcho: view existing tickets.
        - /estchoposkilam: view skills (UI words)
        - /msg: send a message

        Soon:
        - /assign: Assign tickets to specific agents.
        - /status: Check the status of a ticket.
        - /resolve: Resolve a ticket after it has been completed.
        - /close: Close a ticket.

        So go ahead and explore the bot!
        If you have any questions or need assistance, feel free to reach out to our support team. Enjoy your experience! 🚀""",
    "es": """🤖 ¡Bienvenido a nuestro bot oneSitePls!
         Para empezar, te recomendamos sumergirte en la parte más interesante ejecutando el comando "/topquiz".
         ¡Esto le mostrará las mejores pruebas disponibles para evaluar sus conocimientos y divertirse! 🎉

         Si prefiere explorar otras características de nuestro bot, puede probar los siguientes comandos:
         - /start
         - /help
         - /reg o /regClient.
         Este comando le permite registrarse como Agente o Cliente. Los Agentes y Clientes tendrán acceso a comandos adicionales.

         Aquí hay algunos comandos que puede usar después del registro:
         - /go o /ticket: crea un nuevo ticket de soporte.
         - /estcho: ver los tickets existentes.
         - /estchoposkilam: ver habilidades (palabras de interfaz de usuario)
         - /msg: enviar un mensaje

         Pronto:
         - /asignar: Asignar tickets a agentes específicos.
         - /status: Verifica el estado de un ticket.
         - /resolve: resuelve un ticket después de que se haya completado.
         - /cerrar: Cerrar un ticket.

         ¡Así que adelante y explora el bot!
         Si tiene alguna pregunta o necesita ayuda, no dude en comunicarse con nuestro equipo de soporte. ¡Disfruta de tu experiencia! 🚀""",
    "ru" : """🤖 Добро пожаловать в наш oneSitePls бот!

         Для начала мы рекомендуем погрузиться в самое интересное, выполнив команду «/topquiz». 
         Это покажет вам лучшие доступные викторины, чтобы проверить свои знания и немного развлечься! 🎉

         Если вы предпочитаете изучить другие функции нашего бота, вы можете попробовать команду:
         - "/start"
         - "/help"
         - "/reg" или "/regClient". 
         Эта команда позволяет вам зарегистрироваться в качестве Агента или Клиента. Агенты и Клиенты будут иметь доступ к дополнительным командам.

         Вот некоторые команды, которые вы можете использовать после регистрации:
         - "/go" или "/ticket": создать новую заявку на поддержку.
         - "/estcho": просмотр существующих заявок.
         - "/estchoposkilam": просмотр скилов (UI словечки)
         - "/msg": отправить сообщение

         soon:
         - "/assign": Назначение заявок конкретным агентам.
         - "/status": проверить статус заявки.
         - "/resolve": разрешить заявку после ее выполнения.
         - "/close": завершить заявку.


         Итак, вперед, исследуйте бота! 
         Если у вас есть какие-либо вопросы или вам нужна помощь, не стесняйтесь обращаться к нашей команде поддержки. Наслаждайтесь своим опытом! 🚀""",
    
    "uk" : """🤖 Ласкаво просимо до нашого бота oneSitePls!

         Для початку рекомендуємо зануритися в найцікавіше, виконавши команду "/topquiz".
         Це покаже вам найкращі доступні тести, щоб перевірити свої знання та трохи повеселитися! 🎉

         Якщо ви віддаєте перевагу досліджувати інші функції нашого бота, ви можете спробувати такі команди:
         - /start
         - /help
         - /reg або /regClient.
         Ця команда дозволяє зареєструватися як Агент або Клієнт. Агенти та клієнти матимуть доступ до додаткових команд.

         Ось кілька команд, якими можна скористатися після реєстрації:
         - /go або /ticket: створити нову заявку в службу підтримки.
         - /estcho: переглянути існуючі квитки.
         - /estchoposkilam: навички перегляду (слова інтерфейсу користувача)
         - /msg: відправити повідомлення

         незабаром:
         - /assign: призначити квитки певним агентам.
         - /status: перевірити статус квитка.
         - /resolve: Вирішити заявку після її завершення.
         - /close: закрити заявку.

         Тож продовжуйте досліджувати бота!
         Якщо у вас виникли запитання або вам потрібна допомога, зверніться до нашої служби підтримки. Насолоджуйтесь враженнями! 🚀""",
    "Россияen" : "Russia",
    "Россияuk" : "Росія",
    "Россияru" : "Россия",
    "СШАen" : "USA",
    "СШАru" : "США",
    "СШАuk" : "США",
    "Украинаen" : "Ukraine",
    "Украинаru" : "Украина",
    "Украинаuk" : "Україна",
    
    "mainen" : "Hello, welcome to the self-learning center, let me clarify a couple of things.\nOptional, use /cancel to cancel, it's just a test for a motherfucker \n\nWho is the aggressor?\n\nUkraine or Russia?",
    "mainru" : "Привет, добро пожаловать в центр самообучения, позволь уточнить пару моментов.\nНеобязательно, пошли /cancel для отмены, просто это тест на долбоеба \n\nКто агрессор?\n\nУкраина или Россия?",
    "mainuk" : "Привіт, ласкаво просимо до центру самонавчання, дозволь уточнити пару моментів.\nНеобов'язково, пішли /cancel для скасування, просто це тест на довбоєба \n\nХто агресор?\n\nУкраїна чи Росія?",
    
    "Украина или Россия?en" : "Ukraine or Russia?",
    "Украина или Россия?ru" : "Украина или Россия?",
    "Украина или Россия?uk" : "Україна чи Росія?",

    "Вы были заблокированы из-за неправильных ответов.en" : "You have been blocked due to incorrect answers.",
    "Вы были заблокированы из-за неправильных ответов.ru" : "Вас заблокували через неправильні відповіді.",
    "Вы были заблокированы из-за неправильных ответов.uk" : "Вы были заблокированы из-за неправильных ответов.",
    "relaxen" : "Relax dude, postpone it till tomorrow, like you've done it your whole life. You won't make it!",
    "relax2en" : "Joking! You're doing great! Keep up the good work! 😄",
    "relaxru" : "Расслабься, чувак, отложи на завтра, как будто всю жизнь этим занимался. Не сможешь!",
    "relax2ru" : "Шучу! У тебя отлично получается! Продолжай в том же духе! 😄",
    "relaxuk" : "Розслабся, чувак, відклади це на завтра, ніби ти робив це все життя. Ти не встигнеш!",
    "relax2uk" : "Жартую! у вас все чудово! Продовжуй гарно працювати! 😄",
    "nicknameen" : "Please set nickname",
    "nicknameru" : "Задай се никнейм",
    "nicknameuk" : "Будь ласка, встановіть псевдонім",
    "details_en" : "Please provide a small description of your website creation request:",
    "details_ru": "Пожалуйста, предоставьте небольшое описание вашего запроса на создание веб-сайта:",
    "details_uk" : "Надайте невеликий опис запиту на створення веб-сайту:",
    "price_en" : "What is your price cap for the website creation?",
    "urgence_en" : "How urgent is your website creation request?",
    "examplink_en" : "Please provide a link to a preferred example website:",
    "price_uk" : "Який у вас обмеження ціни на створення веб-сайту?",
    "urgence_uk" : "Наскільки терміновим є ваш запит на створення веб-сайту?",
    "examplink_uk" : "Будь ласка, надайте посилання на бажаний приклад веб-сайту:",
    "price_ru": "Каков ваш потолок цен на создание сайта?",
    "urgence_ru" : "Насколько срочный ваш запрос на создание сайта?",
    "examplink_ru": "Пожалуйста, предоставьте ссылку на предпочтительный пример веб-сайта:",
    "shortcut_en" : "You can use the following shortcut to create a support request: ",
    "shortcut_ru": "Вы можете использовать следующий Запрос для создания запроса в службу поддержки: ",
    "shortcut_uk" : "Ви можете скористатися наступним ярликом, щоб створити запит на підтримку: ",
    "noticket_en" : "Support request creation cancelled.",
    "noticket_uk": "Створення запиту на підтримку скасовано.",
    "noticket_ru": "Создание запроса в службу поддержки отменено.",
    "regfirst_en" : "New user - please register first and then retry: /reg or /regClient",
    "regfirst_en" : "Новий користувач - спочатку зареєструйтеся, а потім повторіть спробу: /reg або /regClient",
    "regfirst_uk" : "Новий користувач - спочатку зареєструйтеся: /reg або /regClient",
    "ticket_success_en" : "Support request created successfully!",
    "ticket_success_uk" : "Запит на підтримку створено успішно!",
    "ticket_success_ru": "Запрос в службу поддержки создан успешно!",
    "ticket_success_bm_en" : "New Support request was justcreated!",
    "ticket_success_bm_ru": "Только что создан новый запрос в службу поддержки!",
    "ticket_success_bm_uk" : "Щойно створено новий запит на підтримку!",

        # Add more translations if needed
    }
